app/models/user.rb

    def reset_session_token!
        self.session_token = SecureRandom.base64(64) #use class method generate_session_token
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "a0Y2eFwtH5OLvs6sHQLDvC4AfxdvNAbEFQ7M+okhDQD/CDsMdK+S7ImoazVQ8pKRtOOasmoArXGdlM1g9MlD1A=="], ["updated_at", "2020-05-04 21:36:55.654754"], ["id", 1]]